<a href="https://colab.research.google.com/github/martin-fabbri/colab-notebooks/blob/master/customer-analytics/customer_segmentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Customer Segmentation

## Cohort Analysis

### Time cohorts

In [0]:
#@title ## Setup
#@markdown * Import dependencies
#@markdown * Download dataset (UCI Online Retail II Data Set)
#@markdown ---
#@markdown **Data Set Information:**
#@markdown This Online Retail II data set contains all the transactions 
#@markdown occurring for a UK-based and registered, non-store online retail 
#@markdown between 01/12/2009 and 09/12/2011.The company mainly sells unique 
#@markdown all-occasion gift-ware. Many customers of the company are wholesalers.

from datetime import datetime
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
import seaborn as sns
import matplotlib.colors as mcolors

from operator import attrgetter


!wget https://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx -q

In [0]:
online = pd.read_excel('Online Retail.xlsx', 
                   dtype={'CustomerID': str,  'InvoiceID': str},
                   parse_dates=['InvoiceDate'],
                   infer_datetime_format=True)
online = online.dropna(subset=['CustomerID'])

In [20]:
online.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...      17850  United Kingdom
1    536365     71053  ...      17850  United Kingdom
2    536365    84406B  ...      17850  United Kingdom
3    536365    84029G  ...      17850  United Kingdom
4    536365    84029E  ...      17850  United Kingdom

[5 rows x 8 columns]

* Time cohorts group customers by the time of their first purchase.

In [29]:
get_month = lambda d: datetime(d.year, d.month, 1)  
online['InvoiceMonth'] = online['InvoiceDate'].apply(get_month)
grouping = online.groupby(['CustomerID'])['InvoiceMonth']
online['CohortMonth'] = grouping.transform('min')
online.head()

  InvoiceNo StockCode  ... InvoiceMonth  CohortMonth
0    536365    85123A  ...   2010-12-01   2010-12-01
1    536365     71053  ...   2010-12-01   2010-12-01
2    536365    84406B  ...   2010-12-01   2010-12-01
3    536365    84029G  ...   2010-12-01   2010-12-01
4    536365    84029E  ...   2010-12-01   2010-12-01

[5 rows x 10 columns]

In [0]:
get_date_int = lambda df, column: (df[column].dt.year, df[column].dt.month, df[column].dt.day)

In [52]:
invoice_year, invoice_month, _ = get_date_int(online, 'InvoiceMonth')
cohort_year, cohort_month, _ = get_date_int(online, 'CohortMonth')

years_diff = invoice_year - cohort_year
months_diff = invoice_month - cohort_month

online['CohortIndex'] = years_diff * 12 + months_diff + 1
online.head()

  InvoiceNo StockCode  ... CohortMonth  CohortIndex
0    536365    85123A  ...  2010-12-01            1
1    536365     71053  ...  2010-12-01            1
2    536365    84406B  ...  2010-12-01            1
3    536365    84029G  ...  2010-12-01            1
4    536365    84029E  ...  2010-12-01            1

[5 rows x 11 columns]

### Monthly active customers for each cohort

In [65]:
grouping = online.groupby(['CohortMonth', 'CohortIndex'])
cohort_data = grouping['CustomerID'].nunique()
cohort_data = cohort_data.reset_index()
cohort_counts = cohort_data.pivot(index='CohortMonth', columns='CohortIndex', values='CustomerID')
cohort_counts.head()

CohortIndex     1      2      3      4   ...     10     11     12     13
CohortMonth                              ...
2010-12-01   948.0  362.0  317.0  367.0  ...  374.0  354.0  474.0  260.0
2011-01-01   421.0  101.0  119.0  102.0  ...  146.0  155.0   63.0    NaN
2011-02-01   380.0   94.0   73.0  106.0  ...  119.0   35.0    NaN    NaN
2011-03-01   440.0   84.0  112.0   96.0  ...   39.0    NaN    NaN    NaN
2011-04-01   299.0   68.0   66.0   63.0  ...    NaN    NaN    NaN    NaN

[5 rows x 13 columns]

In [63]:
cohort_data

   CohortMonth  CohortIndex  CustomerID
0   2010-12-01            1         948
1   2010-12-01            2         362
2   2010-12-01            3         317
3   2010-12-01            4         367
4   2010-12-01            5         341
..         ...          ...         ...
86  2011-10-01            2          93
87  2011-10-01            3          46
88  2011-11-01            1         321
89  2011-11-01            2          43
90  2011-12-01            1          41

[91 rows x 3 columns]

In [0]:
o = grouping['CustomerID'].apply(pd.Series.nunique)

In [58]:
o

CohortMonth  CohortIndex
2010-12-01   1              948
             2              362
             3              317
             4              367
             5              341
                           ...
2011-10-01   2               93
             3               46
2011-11-01   1              321
             2               43
2011-12-01   1               41
Name: CustomerID, Length: 91, dtype: int64

In [59]:
o[0]

948